---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
source: html/33f6d8b2-b97d-9f79-4468-2906f4d11fa3.htm
---
# StructuralSectionGeneralCEx Members

Creates a new instance of general Channel Cold Formed shape.